#x=1:100
#y=sin(x)
#plot(x,y)
#в р тип. динамичная. numericd-численные тип данных определяет какие операции можно проводить , 2 тип данных-текст,символ logic 
#логика
z=c("А","Б","В")
Z
x=1:10
Y=c(T,F,TRUE,FALSE)
t=1
x+t
z+x
x+w
W="A"
u=c("A",23,T)
S=c(1,T,F,0)
#CHAR след numer след logic 
f=c(x,y,u,S)
a=2
b=3
a=b
a<-2
b<-3
a=b
b=a
# равн и пет равны, обратное направление стрелок, существует отдельная команда assigh
x=1:1000
y=(log10(sin(x^(-3))))
plot(x,y)
#high!
# необходимо делать комит, потом пуш это с сайта сюда, а пул это туда. чтобы делать пуш должны быть изменения на сайте, и доб изменения
v=1:20
t=11
v>t
v=1:20
s=3
v>s
t=1
s=3
t>s
t=1
s=3
t!=s
t=1
s=3
t=s
t=1
s=3
s=t
t=1
s=3
s==t
v=1:20
s=3
s==v
v=1:20
s=3
v==s
v=1:20
s=3
v=s
v=1:20
s=3
t=1
t==v==s
v=1:20
s=3
t=1
v>s & v<t
x=1:20
y=5:9
x+y
t=6:8
x=1:20
x+t
x>y
D=x>y
z=1:15
y=5:10
y==z
D=x>y
D!
x=-8:8
seq(-8,8,by = 2)
length(seq(-8,8,by = 2))
length<-`(seq(-8,8,by = 2),8)
seq(-8,8,by = 2)
x=-8:8
seq(-8,8,by = 2)
Y=-10:0
seq(10,0,-1)
seq(-8,8,by = -2)
seq(-8,8,2)
seq(-8,8,-2)
a=rnorm(1:1000)
length(a)/2
�(a[1:length(a)/2],10,a[1:length(a)/2:length(a)])
a[c(F,F,T)]=0
a==0
1:3|8:10
a=rnorm(1:1000)
b=a[(a>0&a<2|a==-1.5)]
c=a[(a < -1.5 & a > - 0.8) | (a > 0.5 & a < 1)]
b=1:10
b>3
b<5
b[b>8&b<10]
